app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    @comment.user_id = current_user.id
    @comment.save
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id", "user_id") VALUES('2009-11-15 16:20:40', 'ja', '2009-11-15 16:20:40', 2, 5)