app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "title", "body", "updated_at", "user_id") VALUES('2009-11-15 14:11:33', 'lolfag', 'haha', '2009-11-15 14:11:33', 1)
---
  def create
    @post = current_user.posts.create(params[:post])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2009-11-15 13:51:14', "body" = 'hahah' WHERE "id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])