app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."activation_code" = 'cbafa2d4dd09afd8c85ded1cf6bdd3b4e9642500') LIMIT 1
---
  def activate
    self.current_user = params[:activation_code].blank? ? false : User.find_by_activation_code(params[:activation_code])